УТ_для_edt/src/Catalogs/CRM_ШаблоныАвтотекста/CRM_ШаблоныАвтотекста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ШаблоныАвтотекста</name>
  <comment>АПК:1032 АПК:1034 АПК:265 не проверять на орфографию синоним, справку и имя</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АвтотекстСМС</name>
      <description>Автотекст SMS сообщения</description>
    </items>
    <items>
      <name>АвтотекстЗадачи</name>
      <description>Автотекст задачи</description>
    </items>
    <items>
      <name>АвтотекстИнтереса</name>
      <description>Автотекст интереса</description>
    </items>
    <items>
      <name>КоммерческоеПредложение</name>
      <description>Автотекст коммерческого предложения</description>
    </items>
    <items>
      <name>АвтотекстЭлектронногоПисьма</name>
      <description>Автотекст электронного письма</description>
    </items>
  </predefined>
  <attributes>
    <name>Действие</name>
    <comment>Действие</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТабличнойЧасти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеШаблона</name>
    <comment>АПК:1032 не проверять на орфографию синоним</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеLAT</name>
    <comment>АПК:1032 не проверять на орфографию синоним</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ШаблоныАвтотекста/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить предопределенные данные
//
// Параметры:
//  Параметры	 - Структура - Параметры выполнения процедуры.
//  ТолькоФлаг	 - Булево	 - Если Истина, то шаблоны перезаполняются.
//
Процедура ЗаполнитьПредопределенныеДанные(Параметры = Неопределено, ТолькоФлаг = Ложь) Экспорт
	
	//КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ
	
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблона");
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.КоммерческоеПредложениеКлиенту);
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.УстановитьПараметр("ИдентификаторОбъекта"	,ИдентификаторОбъекта);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление
		|	И CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта	= ИдентификаторОбъекта;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта	= ИдентификаторОбъекта;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	Макет		= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблонаЗначениеКолонки");
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,6).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Представление"		,Представление);
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("ИмяТабличнойЧасти"	,ИмяТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление
		|	И CRM_ШаблоныАвтотекста.ИмяТабличнойЧасти = &ИмяТабличнойЧасти
		|	И CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта	= ИдентификаторОбъекта;
			СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ СМС
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстСМС");
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.СообщениеSMS);
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта
		|	И CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ ЭЛЕКТРОННОЕ ПИСЬМО
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьма");
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.ЭлектронноеПисьмоИсходящее);
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		ПредставлениеLAT= СокрЛП(Макет.Область(НомерСтроки,6).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта
		|	И CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.ПредставлениеLAT	= ПредставлениеLAT;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СпрОбъект.ПредставлениеLAT) Тогда
					СпрОбъект.ПредставлениеLAT	= ПредставлениеLAT;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ АНКЕТИРОВАНИЕ
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьмаАнкетирование");
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.ЭлектронноеПисьмоИсходящее);
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта
		|	И CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ ЗАДАЧИ
	Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЗадачи");
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Задачи.ЗадачаИсполнителя);
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта
		|	И CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// АВТОТЕКСТ ИНТЕРЕСА
	Макет		= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"АвтотекстИнтереса");
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.CRM_Интерес);
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("Представление"	,Представление);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта
		|	И CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	Макет		= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"АвтотекстИнтересаЗначениеКолонки");
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
		Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
		ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
		Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		СтароеДействие	= СокрЛП(Макет.Область(НомерСтроки,6).Параметр);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Представление"		,Представление);
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("ИмяТабличнойЧасти"	,ИмяТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление
		|	И CRM_ШаблоныАвтотекста.ИмяТабличнойЧасти = &ИмяТабличнойЧасти
		|	И CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ ТолькоФлаг И Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта	= ИдентификаторОбъекта;
			СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.ИзМакета			= Истина;
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ТолькоФлаг Тогда
				Если ЗначениеЗаполнено(СтароеДействие) И СтароеДействие = СпрОбъект.Действие Тогда
					СпрОбъект.Действие		= Действие;
				КонецЕсли;
				СпрОбъект.Наименование		= Наименование;
				СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
				СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			КонецЕсли;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.ИзМакета				= Истина;
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;

	
КонецПроцедуры

//
//
Процедура ПолучитьМакетЗаполнитьЗначения(РодительЭлемента, ЭлементСправочника = Неопределено)
	
	ТегШаблонаЗначениеКолонки = Ложь;
	Если РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстСМС Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстСМС");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.СообщениеSMS"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЭлектронногоПисьма Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьма");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложение Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблона");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложениеЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблонаЗначениеКолонки");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту"));
		ТегШаблонаЗначениеКолонки = Истина;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.Анкетирование Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьмаАнкетирование");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЗадачи Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЗадачи");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ЗадачаСсылка.ЗадачаИсполнителя"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстИнтереса Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"АвтотекстИнтереса");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.CRM_Интерес"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.ИнтересЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"АвтотекстИнтересаЗначениеКолонки");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.CRM_Интерес"));
		ТегШаблонаЗначениеКолонки = Истина;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Если ТегШаблонаЗначениеКолонки Тогда
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		Иначе
			
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= Неопределено;
			Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
			
		КонецЕсли;
		
		Если (НЕ ЭлементСправочника = Неопределено) И (НЕ ЭлементСправочника.ПредставлениеШаблона = Представление) Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Представление"		,Представление);
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		Запрос.УстановитьПараметр("ИмяТабличнойЧасти"	,ИмяТЧ);
		Запрос.УстановитьПараметр("Родитель"			,РодительЭлемента);
		ТекстЗапроса = "ВЫБРАТЬ
		|	CRM_ШаблоныАвтотекста.Ссылка
		|ИЗ
		|	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
		|ГДЕ
		|	CRM_ШаблоныАвтотекста.ИдентификаторОбъекта = &ИдентификаторОбъекта
		|	И CRM_ШаблоныАвтотекста.ПредставлениеШаблона = &Представление
		|	И CRM_ШаблоныАвтотекста.ИзМакета
		|	И CRM_ШаблоныАвтотекста.Родитель = &Родитель";
		Если НЕ ИмяТЧ = Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И CRM_ШаблоныАвтотекста.ИмяТабличнойЧасти = &ИмяТабличнойЧасти";
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			СпрОбъект					= Справочники.CRM_ШаблоныАвтотекста.СоздатьЭлемент();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.ПредставлениеШаблона		= Представление;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
			СпрОбъект.ИзМакета			= Истина;
			Если НЕ ИмяТЧ = Неопределено Тогда
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			Иначе
				СпрОбъект.ИмяТабличнойЧасти	= "";
			КонецЕсли;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.УстановитьНовыйКод();
			СпрОбъект.Записать();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			СпрОбъект					= Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.Действие			= Действие;
			СпрОбъект.Наименование		= Наименование;
			СпрОбъект.ИдентификаторОбъекта = ИдентификаторОбъекта;
			СпрОбъект.ИзМакета			= Истина;
			Если НЕ ИмяТЧ = Неопределено Тогда
				СпрОбъект.ИмяТабличнойЧасти	= ИмяТЧ;
			Иначе
				СпрОбъект.ИмяТабличнойЧасти	= "";
			КонецЕсли;
			СпрОбъект.Родитель			= Справочники.CRM_ШаблоныАвтотекста[Родитель];
			СпрОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМакетСформироватьСтруктуруЗначений(РодительЭлемента, ЭлементСправочника)
	
	ТегШаблонаЗначениеКолонки = Ложь;
	Если РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстСМС Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстСМС");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.СообщениеSMS"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЭлектронногоПисьма Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьма");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложение Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблона");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.КоммерческоеПредложениеЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ТегШаблонаЗначениеКолонки");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту"));
		ТегШаблонаЗначениеКолонки = Истина;
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.Анкетирование Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЭлектронногоПисьмаАнкетирование");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстЗадачи Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет("АвтотекстЗадачи");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ЗадачаСсылка.ЗадачаИсполнителя"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.АвтотекстИнтереса Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"АвтотекстИнтереса");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.CRM_Интерес"));
		
	ИначеЕсли РодительЭлемента = Справочники.CRM_ШаблоныАвтотекста.ИнтересЗначениеКолонок Тогда
		
		Макет			= Справочники.CRM_ШаблоныАвтотекста.ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"АвтотекстИнтересаЗначениеКолонки");
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.CRM_Интерес"));
		ТегШаблонаЗначениеКолонки = Истина;
		
	КонецЕсли;
	
	Выполнять = Истина;
	
	НомерСтроки = 1;
	Пока Выполнять Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Если СокрЛП(Макет.Область(НомерСтроки,1).Параметр) = "" Тогда
			Прервать;
		КонецЕсли;
		
		Если ТегШаблонаЗначениеКолонки Тогда
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Действие		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,5).Параметр);
		Иначе
			Наименование	= СокрЛП(Макет.Область(НомерСтроки,1).Параметр);
			Представление	= СокрЛП(Макет.Область(НомерСтроки,2).Параметр);
			ИмяТЧ			= Неопределено;
			Действие		= СокрЛП(Макет.Область(НомерСтроки,3).Параметр);
			Родитель		= СокрЛП(Макет.Область(НомерСтроки,4).Параметр);
		КонецЕсли;
		
		Если (НЕ ЭлементСправочника = Неопределено) И (НЕ ЭлементСправочника.ПредставлениеШаблона = Представление) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗначений = Новый Структура;
		СтруктураЗначений.Вставить("Действие",Действие);
		СтруктураЗначений.Вставить("Наименование",Наименование);
		
		Возврат СтруктураЗначений;
	КонецЦикла;
	
КонецФункции

// Процедура - Восстановить значение из макета
//
// Параметры:
//  МассивСтрок	 - Массив - Массив элементов сравочника для заполнения предопределенных элементов.
//
Процедура ВосстановитьЗначениеИзМакета(МассивСтрок) Экспорт
	
	Для Каждого ЭлементСправочника Из МассивСтрок Цикл
		
		Если ЭлементСправочника.Предопределенный Тогда
			ПолучитьМакетЗаполнитьЗначения(ЭлементСправочника);
		ИначеЕсли ЭлементСправочника.Родитель.Предопределенный Тогда
			ПолучитьМакетЗаполнитьЗначения(ЭлементСправочника.Родитель, ЭлементСправочника);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить значение из макета
//
// Параметры:
//  ЭлементСправочника	 - Справочник	 - Справочник, для которого нобходимо получить структуру действий.
// 
// Возвращаемое значение:
//  Структура - Структура строк.
//  Действие - Строка - Фрагмент исполняющего кода.
//  Нименование - Строка - Наименование команду.
//
Функция ПолучитьЗначениеИзМакета(ЭлементСправочника) Экспорт
	
	Возврат ПолучитьМакетСформироватьСтруктуруЗначений(ЭлементСправочника.Родитель, ЭлементСправочника);
	
КонецФункции

// Процедура - Удалить устаревшие элементы
//  Помечает на удаление устаревшие шаблоны автотекста.
//
Процедура УдалитьУстаревшиеЭлементы() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ШаблоныАвтотекста.Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ШаблоныАвтотекста КАК CRM_ШаблоныАвтотекста
	                      |ГДЕ
	                      |	(CRM_ШаблоныАвтотекста.ПредставлениеШаблона ПОДОБНО ""%БУХФОН%""
	                      |			ИЛИ CRM_ШаблоныАвтотекста.ПредставлениеШаблона В (&Представления)
	                      |				И CRM_ШаблоныАвтотекста.Принадлежность = &Принадлежность)");
		
	Запрос.УстановитьПараметр("Принадлежность", Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя());
	Представления = Новый Массив;
	Представления.Добавить("EmailОтвественного");
	Представления.Добавить("ТелефонОтвественного");
	Запрос.УстановитьПараметр("Представления", Представления);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
